[
	{"_id":1, "user_id":1, "date":"2018-06-10 18:45", "text":"Greetings, fellow colleagues. I would like to share my insights on this task. I reckon we should deal with at least half of the points in the plan without further delays. I suggest proceeding from one point to the next and notifying the rest of us with at least short notices. This way is best to keep track of who is doing what."},
	{"_id":2, "user_id":2, "date":"2018-06-12 19:40", "text":"Hi, Corvo. I am sure that that's exactly what is thought best out there in Dunwall. Let's just do what we are supposed to do to get the result."},
	{"_id":3, "user_id":3, "date":"2018-06-12 20:16", "text":"Whoa, Daizy. Corvo is right, though I must admit, he is often way too serious and lacks a good healthy sense of humour.<br>I'd also like to add that half of the points in the plan (btw who wrote it? I would like a long thoughtful conversation in person with the guy / lady in question. Maybe over a chessboard as well) Well, most of the points can be omitted if we rationally split the subtasks between all the parties and optimize the whole line of work."},
	{"_id":4, "user_id":4, "date":"2018-06-14 21:57", "text":"Whatever you say, guys. (And Crake, I don't like chess. Though a blithesome conversation in the cafeteria is highly appreciated)."},
	{"_id":5, "user_id":5, "date":"2018-06-14 22:01", "text":"There are things that you cannot solve by jumping in an X-wing and blowing something up, Daizy)))<br>Okay, guys, let's meet in person, discuss the finale details of the plan and let's begin at last."},
	{"_id":6, "user_id":4, "date":"2018-06-14 22:31", "text":"One more question, guys. Did you see Webix latest Kanban update? I think it can help us in planning our own work..  https://docs.webix.com/media/kanban/kanban_front.png"},
	{"_id":7, "user_id":3, "date":"2018-06-14 22:43", "text":"Wow great, could you please share a link to this tool? Cannot wait for playing around with it."},
	{"_id":8, "user_id":4, "date":"2018-06-14 23:01", "text":"Looks really cool. Here you are :)\nhttps://docs.webix.com/desktop__kanban_board.html"},
	{"_id":9, "user_id":3, "date":"2018-06-14 23:15", "text":"Thanks a million ;)"}
]